---
kind: method
id: M:Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom
zh: 族实例
source: html/ae1158c1-1fb0-0558-0ea4-e1cf76bb8a1e.htm
---
# Autodesk.Revit.DB.FamilyInstance.FlipFromToRoom Method

**中文**: 族实例

Flips the settings of "From Room" and "To Room" for the door or window instance.

## Syntax (C#)
```csharp
public void FlipFromToRoom()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the FamilyInstance is neither a door nor a window.